<a href="https://colab.research.google.com/github/sureshmecad/Google-Colab/blob/master/5_Pandas_CloudyML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# <center><u>Pandas <u> </center>

## 1.[Pandas Series](https://pandas.pydata.org/pandas-docs/stable/reference/series.html)

resource - https://www.youtube.com/watch?v=m7gxnZx2vT4

<p style='text-align: right;'> 1*4=4 points</p>

Import pandas and numpy with their aliases

In [1]:
import numpy as np
import pandas as pd

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [2]:
a = pd.Series([ 100, 200, 300, 400])

Print a, and data type

In [3]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [4]:
a[2]

300

What are the values of index for series a?

<p style='text-align: right;'> 2*4 = 8 points</p>

In [5]:
range(0,4,1)

range(0, 4)

Change the index to  ['c', 'a', 'b', 'd']

In [6]:
a.index = ['c', 'a', 'b', 'd']
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [7]:
a['d']

400

Sort the values wrt to the index and print it

In [8]:
a.sort_index()

a    200
b    300
c    100
d    400
dtype: int64

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

<p style='text-align: right;'> 4*2=8 points</p>

In [9]:
b = pd.Series([800, 450, 100], index=['e', 'f', 'g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [10]:
a = a.append(b)
a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

In [11]:
#print a again after appending b into it
a

c    100
a    200
b    300
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [12]:
a=a.sort_values(ascending=False)
a

e    800
f    450
d    400
b    300
a    200
g    100
c    100
dtype: int64

In [13]:
# print index of a
a.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

## 2. [Pandas DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html)

Reference:-https://www.youtube.com/watch?v=KB-19V-cSs4

<p style='text-align: right;'> 8*2 = 16 points</p>

### Part 1

<p style='text-align: right;'> 5 points</p>

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [14]:
df = pd.DataFrame(a)
df

     0
e  800
f  450
d  400
b  300
a  200
g  100
c  100

Point to ponder! Don't you think series a and dataframe df looks alike? But there must be some difference between them. 
Hey buddy think and write your thoughts below.

In [15]:
# happy to know your comment
 
# A Pandas Series is one dimensioned whereas a DataFrame is two dimensioned. Therefore, a single column DataFrame can have a name for its single column but a Series cannot have a column name. In fact, each column of a DataFrame can be converted to a series

<p style='text-align: right;'> 2 + 1*4 = 6 points</p>

What is the shape of the datafarme <br>

In [16]:
df.shape

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a' ?

In [17]:
df.index

Index(['e', 'f', 'd', 'b', 'a', 'g', 'c'], dtype='object')

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [18]:
#head
# head prints first 5 rows of dataframe
df.head()

     0
e  800
f  450
d  400
b  300
a  200

In [19]:
#tail
# tail prints last 5 rows of dataframe
df.tail()

     0
d  400
b  300
a  200
g  100
c  100

Rename the columns of the dataframe as 'points'

<p style='text-align: right;'> 2 points</p>

In [20]:
df.columns = ["points"]
df

   points
e     800
f     450
d     400
b     300
a     200
g     100
c     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

<p style='text-align: right;'> 5 points</p>

In [21]:
#Create fruits array
import random
import numpy as np
#fruits = ['orange','mango','apple']
fruits_array = np.random.choice(['orange', 'mango', 'apple'], 7)
fruits_array

array(['orange', 'orange', 'orange', 'mango', 'orange', 'apple', 'apple'],
      dtype='<U6')

The above output might vary based randomness

In [22]:
#Create series fruits out of fruits array
fruits = pd.Series(fruits_array)
fruits

0    orange
1    orange
2    orange
3     mango
4    orange
5     apple
6     apple
dtype: object

Change the index of fruits to the index of dataframe df

<p style='text-align: right;'> 5 points</p>

In [23]:
fruits.index = ['e', 'f', 'd', 'b', 'a', 'g', 'c']
fruits

e    orange
f    orange
d    orange
b     mango
a    orange
g     apple
c     apple
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits' <br> print the head of the dataframe to verify

In [24]:
fruits = pd.DataFrame(fruits)
fruits.columns = ["fruits"]
df1 = pd.concat([fruits, df], axis=1)
df1.head()

   fruits  points
e  orange     800
f  orange     450
d  orange     400
b   mango     300
a  orange     200

<u>Bonus optional question:</u> <br>
What if we had to changed the index of the dataframe? <br>
Try to add any series to the dataframe with the origianl index (when index of series is not same as to the index of dataframe)

Use series as pd.Series([100,200,300,400,500,600,700]) and try to add it to df with column name Bonus_number.

Bonus marks: 5 points

In [25]:
#bonus code here

new = pd.Series([100,200,300,400,500,600,700])
new.index = ['e', 'f', 'd', 'b', 'a', 'g', 'c']
new = pd.DataFrame(new)
new.columns = ['Bonus_number']
df2 = pd.concat([df1, new], axis=1)
df2

   fruits  points  Bonus_number
e  orange     800           100
f  orange     450           200
d  orange     400           300
b   mango     300           400
a  orange     200           500
g   apple     100           600
c   apple     100           700

### Part 2
Reference:- https://www.youtube.com/watch?v=yPVQZZmheCg

Create a dataframe  d1 where the columns are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

<p style='text-align: right;'> 2*5=10 points</p>

In [26]:
dict = {'city' : ['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali'], 'Temperature' : [15, 22, 20, 26,-2]}
d1 = pd.DataFrame(dict)

Print d1

In [27]:
d1

         city  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [28]:
d1.shape

(5, 2)

Set city = d1['city']

In [29]:
city = d1['city']

print city <br>
What is the type of city.

In [30]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: city, dtype: object
<class 'pandas.core.series.Series'>

Create another dataframe d2 where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

<p style='text-align: right;'> 3+2+5 = 10 points</p>

In [31]:
dict2 = {'city': ['Bengalaru','Coimbatore','Srirangam','Pondicherry'], 'Temperature': [24,35,36,39]}
d2 = pd.DataFrame(dict2)
d2

          city  Temperature
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [32]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [33]:
d3 = pd.concat([d1, d2], axis=0)
d3

          city  Temperature
0   Chandigarh           15
1        Delhi           22
2       Kanpur           20
3      Chennai           26
4       Manali           -2
0    Bengalaru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

# fun fact at high level

1. .concat() simply stacks multiple DataFrame together either vertically, or stitches horizontally after aligning on index
2. .merge() first aligns two DataFrame' selected common column(s) or index, and then pick up the remaining columns from the aligned rows of each DataFrame

Do you know about join function? This interesting quest we give to you to find.

Select the part of the dataframe such that it contains cities where temp is less then or equal to 20 <br>
How many cities are there?

<p style='text-align: right;'> 5+5=10 points</p>

In [34]:
d3[(d3['Temperature']<= 20)]

         city  Temperature
0  Chandigarh           15
2      Kanpur           20
4      Manali           -2

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [35]:
d3[(d3['Temperature']>= 35)]

          city  Temperature
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

## 3. Applying functions to columns and creating new columns

Reference: https://www.youtube.com/watch?v=L0wMml__Gow

<p style='text-align: right;'> 20 points</p>

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [36]:
# write function here

In [37]:
#print d3

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [38]:
# write function here

In [39]:
# check  function c_to_f(10)

In [40]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

## 4. Indexing and selecting rows in DataFrame

Reference:-https://www.youtube.com/watch?v=XKFRFDgA7ZY

<p style='text-align: right;'> 20 points</p>

Select subset of the dataframe d3 such that it contains the cities which are union territories.

Select a subset of the dataframe d3 such that it contains the cities which only have temperature above 90 Farenhiet.

Select only the first three rows of the dataframe d3.

Select all the rows and last two columns in the dataframe.

## 5. Reading csv file and group by

Reference: https://www.youtube.com/watch?v=ENhGz1HkzvY <br>
https://www.youtube.com/watch?v=nulx_VmV7dE

<p style='text-align: right;'> 2*2=4 points</p>

Read the file 'weather_data.csv' and store it in a pandas dataframe 'df'

print the shape and head of the dataframe

Group the dataframe wrt to 'event' and save the resulting output in a variable named 'g'

<p style='text-align: right;'> 5*3 = 15 points</p>

Print g and  type(g)

Iterate over all the temperatures in g and print them

Use the describle method on g to get the complete description on it.

Create a new column in the dataframe df, named 'hot_temp' which contains True if temp is above 30, else False

<p style='text-align: right;'> 5 points</p>

In [41]:
#code here to filter df with above condition

In [42]:
# print df

## Data Range

Reference:-https://www.youtube.com/watch?v=dRxCvSbMEto

<p style='text-align: right;'> 5*3 = 15 points</p>

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

print a

What is the len of a?

What is the type of a?

________________
# Hey high five! You solved the 4th milestone challenge too! Pawri to banti hai ;)
________________

# Its Feedback Time!

We hope you’ve enjoyed this course so far. We’re committed to help you use "AI for All" course to its full potential, so that you have a great learning experience. And that’s why we need your help in form of a feedback here.

**Please fill this feedback form**
 https://zfrmz.in/MtRG5oWXBdesm6rmSM7N